[
    {
        "Job ID": 1,
        "Crawl Timestamp": "2020-12-04 16:35:57 +0000",
        "JobTitle": "Graphic Designer",
        "Company": "Apple",
        "Job Salary": "2,00,000 - 5,50,000 PA.",
        "Job Experience Required": "4 - 9 Years",
        "Key Skills": "Design| Graphic Designing",
        "Location": "Mumbai",
        "Responsibilities": "Shape, shepherd, ship, and show technical programs designed to support the work of Cloud Customer Engineers and Solutions Architects.\\nMeasure and report on key metrics tied to those programs to identify any need to change course, cancel, or scale the programs from a regional to global platform.\\nCommunicate status and identify any obstacles and paths for resolution to stakeholders, including those in senior roles, in a transparent, regular, professional and timely manner.\\nEstablish expectations and rationale on deliverables for stakeholders and program contributors.\\nProvide program performance feedback to teams in Product, Engineering, Sales, and Marketing (among others) to enable efficient cross-team operations."
    },
    {
        "Job ID": 2,
        "Crawl Timestamp": "2020-12-04 04:27:35 +0000",
        "JobTitle": "MIS Executive",
        "Company": "Gazprom",
        "Job Salary": "1,00,000 - 3,00,000 PA.",
        "Job Experience Required": "1 - 2 Years",
        "Key Skills": "Pivot Table| Excel| Workforce Management| VLOOKUP| MIS| Conditional Formatting| Formulas| Macros| Forecasting| WFM",
        "Location": "Gurgaon,Bengaluru",
        "Responsibilities": "Drive cross-functional activities in the supply chain for overall Technical Operational readiness in all NPI phases leading into mass production.\\nCollaborate with suppliers and Engineering teams in assessing process technologies based on project requirements, and propose and develop the manufacturing blueprint including process flow, equipment/fixture designs, implementation schedules and validation plans for engineering builds and mass production.\\nDrive project technical and operational issues with material, process, fixtures, equipment, etc. during the NPI phase to enable delivery of a mature product and manufacturing process into mass production. Support/drive continuous improvement efforts in the supply chain.\\nLead suppliers by providing technical direction to establish and validate (utilizing statistical tools) process capability during the NPI phase for consistently delivering a quality product in mass production.\\nUtilize DOE’s, FMEA and other Industry standard tools to proactively identify and address risks and optimize process parameters."
    },
    {
        "Job ID": 3,
        "Crawl Timestamp": "2020-11-06 16:55:46 +0000",
        "JobTitle": "Systems Engineer",
        "Company": "Sony",
        "Job Salary": "13,00,000 - 18,00,000 PA.",
        "Job Experience Required": "11 - 16 Years",
        "Key Skills": "Java|PLSQL|Actimize|SQL",
        "Location": "Mumbai",
        "Responsibilities": "Collect and analyze data to draw insight and identify strategic solutions.\\nBuild consensus by facilitating broad collaboration with clear communication and documentation.\\nWork with cross-functional stakeholders to gather requirements, manage implementation, and drive delivery of projects."
    },
    {
        "Job ID": 4,
        "Crawl Timestamp": "2020-11-04 23:46:41 +0000",
        "JobTitle": "IOS Developer",
        "Company": "AIA Group",
        "Job Salary": "1,50,000 - 6,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "GIT| SQLite| SVN| api| swift",
        "Location": "Hyderabad",
        "Responsibilities": "Work one-on-one with the top Android, iOS, and web engineers to build exciting new product/API integrations that drive adoption of Google’s developer platforms.\\nConceive new features and ideas that can change how users interact with apps and Google, and help developers build them.\\nConduct regular, engineering-focused meetings with developers to help them design new systems, fix bugs, improve UX, and solve complex code issues.\\nWork on the source code of Google's products with other engineers to identify, reproduce, and/or fix bugs that are affecting developers."
    },
    {
        "Job ID": 5,
        "Crawl Timestamp": "2020-11-04 20:38:39 +0000",
        "JobTitle": "SEO Java Developer",
        "Company": "BHP Group",
        "Job Salary": "4,00,000 - 9,00,000 PA.",
        "Job Experience Required": "3 - 6 Years",
        "Key Skills": "Core Java| Spring Mvc| Hibernate| SEO",
        "Location": "Noida",
        "Responsibilities": "Plan requirements with internal customers.\\nProvide portfolio reports and forecasts to Regional Service Delivery Manager. Manage vendor PM services to usher projects through the entire lifecycle.\\nPlan finances and tracking across a portfolio of projects.\\nEnsure that any changes in scope, schedule or cost are managed in accordance with the agreed change order procedures. Interface with cross functional stakeholders to understand and communicate program strategy and priorities.\\nEnsure project closure processes are completed - including handover to support. Help to validate new and improve existing products by partnering with AV Eng teams. Set operational goals and lead ongoing process and program improvement initiatives."
    },
    {
        "Job ID": 6,
        "Crawl Timestamp": "2020-12-04 17:09:28 +0000",
        "JobTitle": "Python Developer",
        "Company": "Microsoft",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "Rest|NLP|Unit Testing|Analytical Skills|Continuous Integration|Web Technologies|CHATBOT|Javascript|End User|Python|SQL",
        "Location": "Noida",
        "Responsibilities": "Communicate with customers via phone and email.\\nProvide strategic advice and consultation to help our advertisers get the best experience from our advertising products.\\nImplement creative ways to improve customer relationships. Tailor and share online marketing strategy suggestions.\\nWork towards strategic goals, while prioritizing and delivering an outstanding customer experience to Google's advertisers."
    },
    {
        "Job ID": 7,
        "Crawl Timestamp": "2020-12-04 01:40:36 +0000",
        "JobTitle": "Job Description",
        "Company": "AIA Group",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "7 - 12 Years",
        "Key Skills": "CSS|MySQL|Javascript|Bootstrap|Redis|HTML|MongoDB|JQuery|Grunt|Karma",
        "Location": "Chandigarh",
        "Responsibilities": "Manage cross-functional activities in the supply chain for overall Technical Operational readiness in all NPI phases leading into Mass Production.\\nCollaborate with Suppliers and Engineering teams in assessing process technologies based on project requirements and propose and develop manufacturing blueprint including process flow, equipment/fixture designs, implementation schedules and more.\\nManage project technical and operational issues regarding material, process, fixtures, equipment, etc, during NPI phase.\\nUtilize DOE’s, FMEA and other industry standard tools to proactively identify and address risks and optimize process parameters."
    },
    {
        "Job ID": 8,
        "Crawl Timestamp": "2020-12-05 02:10:54 +0000",
        "JobTitle": "Project Manager",
        "Company": "Nippon Telegraph & Tel",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "10 - 13 Years",
        "Key Skills": "C#|Kendo Ui|ASP.Net|Entity Framework|MVC|Telerik|WPF|JQuery|Prism|Ajax",
        "Location": "Bengaluru",
        "Responsibilities": "Lead the development and strategy with partners for healthcare and life sciences. Build relationships with our partners and focus on long term, mutually beneficial solutions.\\nEngage with Product Management, Sales and Engineering teams to align product directions with our external partners.\\nWork with peer teams to establish partner strategy and priorities that will determine recruiting and partner development focus. Be responsible for recruiting, developing and supporting strategic technology partnerships and the partner ecosystem.\\nHelp partners leverage Google's technology to enhance their own offerings, integrate with them to fill gaps in and extend our product portfolio.\\nBe the point of contact for partners around key areas (Operations, Financial, Sales, Training, Product Enhancement, etc.) and drive new partnerships, support integration of new products to existing partners, and ensure the prompt and proper resolution of daily business challenges."
    },
    {
        "Job ID": 9,
        "Crawl Timestamp": "2020-12-04 03:39:30 +0000",
        "JobTitle": "PM (atc)",
        "Company": "Walt Disney",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "Java|PLSQL|Actimize|SQL",
        "Location": "Chennai",
        "Responsibilities": "Develop CM/ODM strategy and implement supplier management processes with critical partners.\\nLead the creation and implementation of RFX processes for sourcing needs.\\nManage the agreement creation process with the cross-functional program needs in mind.\\nManage assigned manufacturing partner to program requirements in cost, quality, schedule and technology areas.\\nPerform periodic cost improvement ideas in terms of DFM or alternative technology choices."
    },
    {
        "Job ID": 10,
        "Crawl Timestamp": "2020-11-04 14:48:53 +0000",
        "JobTitle": "Branch Manager",
        "Company": "Intel",
        "Job Salary": "9,00,000 - 12,00,000 PA.",
        "Job Experience Required": "10 - 15 Years",
        "Key Skills": "sales| Salesforce| time share| Branch Manager",
        "Location": "Mumbai",
        "Responsibilities": "Help compile customer requirements as well as survey existing customer IT landscape to enable integrations from PoC stage to a full deployment of products managing healthcare and/or life sciences data in Google Cloud.\\nDefine the business case for solutions, design solutions to help prototype and develop the customer’s new environment, and guide solutions through launch to market. Create training materials, guides, demonstrations and white papers and help scale solutions delivery.\\nEngage standards communities to drive the development of standards that meet platform and customer needs, and ensure that standards implementers know what the Google Cloud Healthcare platform can do for them.\\nDemonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers. Provide customer and market feedback to the Product and Engineering teams and help shape product direction.\\nTravel as required in-region for meetings, technical reviews and onsite delivery activities."
    },
    {
        "Job ID": 11,
        "Crawl Timestamp": "2020-12-04 13:42:13 +0000",
        "JobTitle": "Senior Advocate",
        "Company": "ExxonMobil",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "5 - 7 Years",
        "Key Skills": "vetting| agreement| contract| Legal Notices| Statutory Compliance| Risk Advisory| Legal Drafting| Suits| Drafting| Legal Documentation| Petitions| Conveyancing| Lawyer Activities",
        "Location": "Pune",
        "Responsibilities": "Build and maintain the Support Operations Analytics infrastructure.\\nCustomize and maintain tools to provide insights and visibility into key strategic and operational performance of the organization.\\nDefine and action analysis on operational data sets to provide strategic recommendations to multiple levels of leadership; package analysis for reports and presentations to shape strategic and operational decisions.\\nDraw insights from analyzing data to improve Support Operations quality and efficiency.\\nContribute to strategic planning around product launches."
    },
    {
        "Job ID": 12,
        "Crawl Timestamp": "2020-12-04 23:08:46 +0000",
        "JobTitle": "Senior UI Developer",
        "Company": "Oracle",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "6 - 10 Years",
        "Key Skills": "css|software development|html5|tdd|ui development|html|javascript|jquery|microservices",
        "Location": "Bengaluru",
        "Responsibilities": "Serve as point of contact for Partners and manage consistent and operationally efficient “Partner first” business practices to onboard and support our partners through their partnership lifecycle.\\nUnderstand and propose the necessary systems and process changes to reduce friction for our partners and Sales teams.\\nContribute to the development of existing and future state Partner Onboarding activities and initiatives that develop ongoing touch points with Partners to increase their success with Google Cloud.\\nPromote new initiatives and offers proactively to our partners in a scalable fashion that energizes our partner ecosystem."
    },
    {
        "Job ID": 13,
        "Crawl Timestamp": "2020-11-04 07:59:46 +0000",
        "JobTitle": "Associate Advocate",
        "Company": "Softbank",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "4 - 8 Years",
        "Key Skills": "Legal| Drafting| Title Search| Due Diligence",
        "Location": "Mumbai ,Navi Mumbai",
        "Responsibilities": "Implement creative ways to improve our customer relationships, tailor and share online marketing strategy suggestions, and promote other Google products.\\nCommunicate with customers proactively, via phone and email.\\nProvide strategic advice and help our advertisers get the best experience from their investment by working with them in a consultative role.\\nDeliver consistently against strategic goals while prioritizing and delivering an outstanding customer sales experience to Google's advertisers."
    },
    {
        "Job ID": 14,
        "Crawl Timestamp": "2020-11-04 23:08:25 +0000",
        "JobTitle": "Business Analyst",
        "Company": "BNP Paribas",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "sales forecasting|business analysis|market sizing|lead generation",
        "Location": "Gurgaon",
        "Responsibilities": "Develop and track core metrics across all Google Cloud products, including overall satisfaction, customer effort, net promoter score (NPS), partner satisfaction, etc.\\nBuild and maintain reports, dashboards and metrics to monitor the performance of the program\\nApply quantitative analysis, data mining and data presentation to provide meaningful business insights to stakeholders (with support from data scientists)\\nProvide insights that influence and drive actions/improvements across the customer journey\\nDemonstrate ability to manage risks at the operational level to ensure smooth execution of survey launches"
    },
    {
        "Job ID": 15,
        "Crawl Timestamp": "2020-12-04 13:35:12 +0000",
        "JobTitle": "Dermatologist",
        "Company": "Berkshire Hathaway",
        "Job Salary": "4,50,000 - 8,00,000 PA.",
        "Job Experience Required": "0 - 2 Years",
        "Key Skills": "cosmetology| dermatology| Dermatologist| derma",
        "Location": "Pune",
        "Responsibilities": "Produce required design specifications, provide technical leadership and architectural mentorship and help customers build quality technical solutions/implementations with on-premises, cloud and hybrid cloud-based Apigee solution.\\nWork closely with geographically distributed Apigee and Customer project teams to align the technical requirements and the solution design with the customer's business drivers and in order to demonstrate our value.\\nAct as a liaison for the engineering and product teams to commercialize solutions with partners and customers.\\nTravel up to 50% of the time."
    },
    {
        "Job ID": 16,
        "Crawl Timestamp": "2020-11-04 03:35:12 +0000",
        "JobTitle": "US Accountant",
        "Company": "BHP Group",
        "Job Salary": "2,00,000 - 4,00,000 PA.",
        "Job Experience Required": "1 - 2 Years",
        "Key Skills": "Mba Finance| Monthly Reports| Excel| Accounting| Reconciliation| Book Keeping| Quick Books| MIS Reporting| Ca| Ap",
        "Location": "Noida",
        "Responsibilities": "Develop and execute CPU commodity, component, and module strategies for Consumer Hardware. Continually identify and implement new opportunities for Cost Savings and Cost Avoidance including optimizing the supply base for Google’s Consumer Hardware needs."
    },
    {
        "Job ID": 17,
        "Crawl Timestamp": "2020-12-04 04:52:51 +0000",
        "JobTitle": "Staff QA Engineer",
        "Company": "Enel",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "8 - 12 Years",
        "Key Skills": "switching|VirtualBox|Zigbee|Test Planning|VLAN|ESX|IOT|QA|Z - Wave|BLE|OSI model|Staff QA Engineer|Quality Assurance Engineering|Test Cases",
        "Location": "Bengaluru",
        "Responsibilities": "Address all areas of global sourcing and supply chain management including commodity business plans, supplier performance management and global market analysis."
    },
    {
        "Job ID": 18,
        "Crawl Timestamp": "2020-12-04 18:05:30 +0000",
        "JobTitle": "Quality Analyst",
        "Company": "Sumitomo Mitsui Financial",
        "Job Salary": "2,00,000 - 4,75,000 PA.",
        "Job Experience Required": "1 - 2 Years",
        "Key Skills": "Communication Skills| Quality Analysis| Voice Process| Denial Management| Medical Billing",
        "Location": "Chennai",
        "Responsibilities": "Develop deep understanding of cost competing technologies, process and products to guide and influence product development and decisions; create and/or optimize models for evaluating modules, components and new processes."
    },
    {
        "Job ID": 19,
        "Crawl Timestamp": "2020-11-06 03:58:51 +0000",
        "JobTitle": "BIG DATA Developer",
        "Company": "IBM",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "4 - 9 Years",
        "Key Skills": "Hadoop| HBase| NoSQL| Cassandra| Big Data Analytics| MongoDB| Data Integration",
        "Location": "Mumbai Suburbs",
        "Responsibilities": "Collaborate closely with cross-functional teams to identify cost opportunities and risks related to product design and business plans."
    },
    {
        "Job ID": 20,
        "Crawl Timestamp": "2020-12-05 22:21:00 +0000",
        "JobTitle": "AVP - Operations",
        "Company": "Samsung Electronics",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "20 - 30 Years",
        "Key Skills": "Steel| Operations| Steel Plant",
        "Location": "Delhi NCR",
        "Responsibilities": "Develop global sourcing strategies with defined plans for risk assessment and mitigation, and supply planning agreements."
    },
    {
        "Job ID": 21,
        "Crawl Timestamp": "2020-12-04 02:10:06 +0000",
        "JobTitle": "UI UX Designer,",
        "Company": "Brookfield Asset Management",
        "Job Salary": "3,00,000 - 6,00,000 PA.",
        "Job Experience Required": "3 - 6 Years",
        "Key Skills": "Angularjs| CSS| jQuery| Html5| SAAS| Javascript| Bootstrap| MVC",
        "Location": "Hyderabad",
        "Responsibilities": "Apply advanced statistical methods and work with large, complex data sets.\\nSolve difficult, non-routine challenges, and clearly communicate highly technical results and methods.\\nInteract cross-functionally with a wide variety of people and teams.\\nLead investigations into multiple streams of ads quality data."
    },
    {
        "Job ID": 22,
        "Crawl Timestamp": "2020-11-04 02:19:02 +0000",
        "JobTitle": "Ofsaa",
        "Company": "Citigroup",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "SQL|Unix|Risk management|Operations|Business reporting|FTP|Treasury management|liquidity risk|Environment management|PLSQL",
        "Location": "Mumbai",
        "Responsibilities": "Build and manage an engineering productivity team focused on improving testability of the Google’s diverse project areas and platforms.\\nCreate the next generation developer infrastructure for Google, focusing on developer experience, integration and scalability.\\nDefine team strategy and roadmap, and drive adoption of test infrastructure across several product areas.\\nManage the development of engineers on your teams through project and task assignment, individual coaching and identifying relevant training classes.\\nProvide knowledge in the application of Machine Learning to engineering productivity challenges, driving the creation of innovative tools with Google-wide impact."
    },
    {
        "Job ID": 23,
        "Crawl Timestamp": "2020-11-04 18:19:43 +0000",
        "JobTitle": "Purchase Manager",
        "Company": "Sony",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "5 - 10 Years",
        "Key Skills": "purchase management| procurement| sourcing| negotiation| supplier quality| bill passing| iso| ERP System",
        "Location": "Ahmedabad (Vatva)",
        "Responsibilities": "Set the standard for successful delivery and execution regarding customer engagements. Lead by example when it comes to making customers in your region successful.\\nShare best practices proactively with your counterparts in other regions. Emphasize shared success across your team and across regions.\\nEstablish and maintain your team’s position as key strategic advisor to business executives and IT stakeholders for Google Cloud’s accounts, ensuring their business priorities are met using Google Cloud solutions.\\nWork with customer technical leads, client executives, and partners to manage and deliver successful migrations to Google Cloud solutions.\\nBuild the capabilities of Google’s channel partners in your region by establishing Professional Services Organization (PSO)/partner go-to-market strategies, and by actively developing and sharing best practice recommendations gained during customer engagements."
    },
    {
        "Job ID": 24,
        "Crawl Timestamp": "2020-12-04 19:47:28 +0000",
        "JobTitle": "Video Editor",
        "Company": "Apple",
        "Job Salary": "1,50,000 - 3,00,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "Video Editing| Videography| Video Editor| audio editing",
        "Location": "Delhi NCR",
        "Responsibilities": "Develop and track core metrics across all Google Cloud products, including overall satisfaction, customer effort, net promoter score (NPS), partner satisfaction, etc.\\nBuild and maintain reports, dashboards and metrics to monitor the performance of the program\\nApply quantitative analysis, data mining and data presentation to provide meaningful business insights to stakeholders (with support from data scientists)\\nProvide insights that influence and drive actions/improvements across the customer journey\\nDemonstrate ability to manage risks at the operational level to ensure smooth execution of survey launches"
    },
    {
        "Job ID": 25,
        "Crawl Timestamp": "2020-11-04 03:53:46 +0000",
        "JobTitle": "B.COM Faculty",
        "Company": "Oracle",
        "Job Salary": "5,50,000 - 6,50,000 PA.",
        "Job Experience Required": "3 - 6 Years",
        "Key Skills": "University| Bcom| MCOM| Educational Qualification",
        "Location": "Kolkata",
        "Responsibilities": "Manage a global team of Technical Trainers.\\nGrow the team to achieve staffing goals while ensuring high training standards are maintained.\\nOptimize the performance of the Training team by ensuring the team has access to the necessary resources, assets, networks and tools.\\nEnsure best training practices are shared across the global team.\\nWork cross-functionally with the Curriculum Development team to ensure an effective feedback loop is in place between instructors and that team. Optimize delivery schedules to ensure alignment with business goals."
    },
    {
        "Job ID": 26,
        "Crawl Timestamp": "2020-11-04 09:13:35 +0000",
        "JobTitle": "ERP Lead Consultant",
        "Company": "Novartis",
        "Job Salary": "3,50,000 - 5,00,000 PA.",
        "Job Experience Required": "7 - 10 Years",
        "Key Skills": "java|soap|rest|axis|xslt|sap pi|sap netweaver|consultant|SAP ABAP",
        "Location": "Bengaluru",
        "Responsibilities": "Work with Partner Managers to identify and recruit partners in the market that can deliver innovative solutions to our customers, built on top of Google Cloud (Google Cloud Platform and G Suite).\\nDevelop our partners’ technical teams with both sales and technical competencies, so that they can be successful in the market.\\nKeep partners up-to-date with product and technical knowledge and market differentiators.\\nWork with partner technical representatives in opportunities and projects, complementing their skill and guaranteeing high quality customer deliverables. Advise on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers and partners to optimize Google Cloud effectiveness.\\nAct as a technical advocate within Google for our partners in order to help provide feedback from the field, as well as to present on their behalf."
    },
    {
        "Job ID": 27,
        "Crawl Timestamp": "2020-12-04 04:37:40 +0000",
        "JobTitle": "Angular Developer",
        "Company": "Commonwealth Bank",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "front end| node.js| application developer| ux| mean stack| unit testing| mongodb",
        "Location": "Kolkata",
        "Responsibilities": "Obtain and maintain an in-depth understanding of Google's product technology, architecture and implementation. Cultivate and transfer knowledge to Google’s support groups.\\nGuide or perform design and implementation of new support, productivity or investigation tools in order to increase efficiency for the technical support process.\\nAct as a consultant and knowledge base for Product Managers, Sales Engineers, Technical Account Managers, and Deployment Specialists, resolving technical deployment obstacles, improving the product's vision and making Google customers successful.\\nWork closely with multiple Google Product Management and Software Engineering teams on understanding ways to improve the product. Interact with Quality Assurance (QA) teams to drive exceptional testing quality.\\nDiagnose and resolve complex customer problems for the Google Chrome product area in an engineering support function, as part of a global 24x7 global team."
    },
    {
        "Job ID": 28,
        "Crawl Timestamp": "2020-11-04 19:37:10 +0000",
        "JobTitle": "Export Manager",
        "Company": "General Motors",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "10 - 17 Years",
        "Key Skills": "export marketing|export sales|export management|international trade|International Sales|International Marketing",
        "Location": "Ahmedabad",
        "Responsibilities": "Understand the supply chain data structure and critical data elements that bridge across multiple supply chain functions, integrate with supply chain tools and are shared with external stakeholders.\\nIdentify data integrity matters and gaps, and structure and manage data clean-up projects to increase accuracy while also implementing long-term process improvements and automation/tool development.\\nScope, drive and implement cross-functional projects that drive the operationalization of data integrity and management as part of supply chain operational responsibilities.\\nDefine and implement metrics focused around data management. Ensure buy-in and support from cross-functional data owners"
    },
    {
        "Job ID": 29,
        "Crawl Timestamp": "2020-12-04 17:54:34 +0000",
        "JobTitle": "Purchase Executive",
        "Company": "Royal Dutch Shell",
        "Job Salary": "2,00,000 - 2,50,000 PA.",
        "Job Experience Required": "0 - 1 Years",
        "Key Skills": "Field Work| Vendor Management",
        "Location": "Gurgaon,Bengaluru",
        "Responsibilities": "Work as part of the Sales team to identify and qualify Platform opportunities and determine if Google Cloud Platform is right for them. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nTake responsibility for leading the technical project, including such activities as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources.\\nWork hands-on with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Travel frequently around EMEA for meetings, technical reviews and onsite delivery activities.\\nPrepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness."
    },
    {
        "Job ID": 30,
        "Crawl Timestamp": "2020-11-04 15:37:10 +0000",
        "JobTitle": "HR Recruiter",
        "Company": "Toyota Motor",
        "Job Salary": "1,00,000 - 3,00,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "non it recruiter| recruitment| bulk hiring| hr| bpo hiring",
        "Location": "Bengaluru",
        "Responsibilities": "Work with JAPAC Partner and Alliances Lead to develop the Go-to-Market strategy for the region. Build and lead a team of technical Partner Engineers across APAC and Japan.\\nIdentify and recruit partners in the market that can deliver innovative solutions to our customers, built on top of Google Cloud.\\nDevelop Partners’ technical teams advising on their technical business plan and readiness, so that they can be successful in the market. Keep them up to date with latest product and technical knowledge and be an internal technical advocate for them, to help provide feedback from the field.\\nEngage with technical leadership parterns in large strategic opportunities and projects, complementing their skill and guaranteeing high quality customer deliverables.\\nTravel up to 40% of the time as required, to visit partners across a defined geographic territory."
    },
    {
        "Job ID": 31,
        "Crawl Timestamp": "2020-12-06 00:59:31 +0000",
        "JobTitle": "Job Description",
        "Company": "General Electric",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "5 - 10 Years",
        "Key Skills": "Hinges|Check Arms|Latches|Door handles|Design Development|Window Winders|Product Design|Strikers|Assembly Process|Manufacturing|Gas Struts",
        "Location": "Pune",
        "Responsibilities": "Oversee a sales program across office(s), responsible for delivering appointments between prospective new advertisers and New Business Account Executives.\\nDeliver training programs and execute process to maximize productivity.\\nImplement and maintain an effective business rhythm."
    },
    {
        "Job ID": 32,
        "Crawl Timestamp": "2020-11-04 20:37:40 +0000",
        "JobTitle": "Interior Designer",
        "Company": "CVS Health",
        "Job Salary": "3,50,000 - 5,00,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "Sketchup| Design Development| REVIT| Concept Design| Photoshop| autocad| Interior Designing",
        "Location": "Noida",
        "Responsibilities": "Work closely with our Sales team to identify, develop, and optimize new business opportunities and develop client relationships by leveraging Google products and technologies. Develop cutting-edge solutions as the technical lead, provide consulting services to our partners, build lasting relationships and be sensitive to client needs.\\nHelp partners in their day-to-day challenges by delivering innovative and scalable solutions and troubleshooting their issues.\\nPropose, design, create and present prototypes, demos and proofs-of-concept to a wide variety of audiences, from engineers to marketing professionals.\\nPerform implementation reviews. Advocate for new product features, and provide partner feedback to internal cross-functional teams including Product Management and Engineering.\\nTravel as required to meet with specific partners/clients internationally."
    },
    {
        "Job ID": 33,
        "Crawl Timestamp": "2020-11-05 05:59:33 +0000",
        "JobTitle": "Technical Lead",
        "Company": "Verizon Communications",
        "Job Salary": "50,000 - 3,00,000 PA.",
        "Job Experience Required": "7 - 10 Years",
        "Key Skills": "IT - Hardware & Networking|Wintel|vmware|virtualization|microsoft exchange|citrix|office 365",
        "Location": "Noida, Chandigarh",
        "Responsibilities": "Provide consulting services, share best practices and conduct technical troubleshooting for clients.\\nWork with core teams to develop strategy, including best practices, change management and optimization analysis.\\nImplement new product features as they relate to client product usage.\\nCollaborate with the regional and global Sales and Services teams to lead monitoring exchange activity efforts and to track performance against goals.\\nEnsure project team, internal management and external customers receive appropriate, timely and accurate project information and status updates, identifying delays, budgets and technical quality concerns so that they can be proactively addressed."
    },
    {
        "Job ID": 34,
        "Crawl Timestamp": "2020-11-05 06:44:14 +0000",
        "JobTitle": "Company Secretary",
        "Company": "Bank of Nova Scotia",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "8 - 10 Years",
        "Key Skills": "company secretary|drafting|due diligence|statutory compliance|companies act|Corporate Governance",
        "Location": "Mumbai",
        "Responsibilities": "Develop a key performance indicators (KPI) dashboard and competitive insights for use by Executive team to manage the business. Establish and lead operating processes and tools for effectively managing the organization, including actively tracking key trends in lagging/leading metrics.\\nProvide insightful data-driven strategic recommendations to leadership. Communicate findings from initiatives to management and the broader organization.\\nPartner closely with other functions relevant to the team, including Product and Engineering, Communications, PR, Marketing, Finance, Legal and Operations. Use cross-functional knowledge and seek to understand issues, trends and perspectives that may influence the business.\\nDrive the Leadership team towards clear, efficient and accountable decision making. Distill and cascade core tenets of our strategy for board, leadership and other internal and external stakeholders."
    },
    {
        "Job ID": 35,
        "Crawl Timestamp": "2020-11-05 15:39:46 +0000",
        "JobTitle": "HR Executive",
        "Company": "MetLife",
        "Job Salary": "1,50,000 - 3,50,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "Recruitment| HR Operations| Talent Acquisition| Volume Hiring| Campus Hiring| Vendor Management| Employee Relations| HR Policies| Payroll| Hr Solutions",
        "Location": "Bengaluru",
        "Responsibilities": "Guide partners and clients through the entire implementation process.\\nConsult with stakeholders to define the project structure, requirements and priorities.\\nManage customer expectations of product delivery by establishing a trusted relationship and regularly communicating project status and requirements.\\nIdentify potential opportunities for service partner development and education.\\nInvestigate and track client concerns and collaborate to resolve any account issues. Work with other departments within GA360 to actively manage and resolve project-related issues."
    },
    {
        "Job ID": 36,
        "Crawl Timestamp": "2020-11-04 15:43:07 +0000",
        "JobTitle": "Creative Lead",
        "Company": "Bank of Nova Scotia",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "8 - 13 Years",
        "Key Skills": "Responsive Web Design| Html5| Bootstrap| Android| UX| Javascript| Accessibility| Mobile Applications| Front End| Web Designing| LESS| Sketch",
        "Location": "Bengaluru",
        "Responsibilities": "Work as part of the Sales team to identify and qualify platform opportunities, and determine if Google Cloud Platform is right for them. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nTake responsibility for leading technical projects, including such activities as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources.\\nWork hands-on with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Travel as required around EMEA for meetings, technical reviews and onsite delivery activities.\\nPrepare and deliver product messaging in an effort to highlight the Google Cloud Platform value proposition, using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on the integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution, providing best practice advice to customers to optimize Google Cloud Platform effectiveness."
    },
    {
        "Job ID": 37,
        "Crawl Timestamp": "2020-12-04 17:34:04 +0000",
        "JobTitle": "Biostatistician 2",
        "Company": "Roche Holding",
        "Job Salary": "7,00,000 - 15,00,000 PA.",
        "Job Experience Required": "2 - 5 Years",
        "Key Skills": "R|Design Analysis|Clinical Science|SAS|Statistics|Statistical Analysis|Macros|Clinical Trials|Health Insurance",
        "Location": "Hyderabad",
        "Responsibilities": "Develop and execute global supply chain strategies.\\nDrive suppliers to ensure material availability and readiness for the development builds and mass production.\\nServe as the escalation point for all supplier related issues in mass production.\\nUnderstand component lead time and evaluate associated supply chain risks."
    },
    {
        "Job ID": 38,
        "Crawl Timestamp": "2020-11-04 08:02:16 +0000",
        "JobTitle": "Unit Sales Manager",
        "Company": "MetLife",
        "Job Salary": "1,00,000 - 5,00,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "Agency Sales| Agent Recruitment| Insurance Sales| Insurance Broking| Motor Insurance| general insurance| Agency Channel",
        "Location": "Delhi NCR,Mumbai,Chennai",
        "Responsibilities": "Coordinate and facilitate between internal teams to gain feedback and insight into agreements and initiatives.\\nAdvise business development and technology management teams, as well as legal on risks around technical solutions and service level commitments.\\nWork with key stakeholders to create, draft and communicate implementation standards to facilitate smoother operations and improve decision making.\\nReview and approve technical agreement terms."
    },
    {
        "Job ID": 39,
        "Crawl Timestamp": "2020-11-04 15:15:24 +0000",
        "JobTitle": "Manager - Finance",
        "Company": "Walmart",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "5 - 10 Years",
        "Key Skills": "Accounting Software|Finance|Financial Reporting|Financial Statements|Financial Management|Management Reporting|Forecasting|Expenses|MS Office|Analytical Skills",
        "Location": "Gurgaon",
        "Responsibilities": "Work as part of the Sales team to identify and qualify platform opportunities. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nLead technical projects including such activities as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work and the coordination of supporting technical resources.\\nWork hands-on with Google for Work Cloud Platform products to demonstrate and prototype integrations in customer/partner environments.\\nPrepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness."
    },
    {
        "Job ID": 40,
        "Crawl Timestamp": "2020-11-05 12:44:53 +0000",
        "JobTitle": "Account Assistant",
        "Company": "IBM",
        "Job Salary": "1,50,000 - 2,00,000 PA.",
        "Job Experience Required": "1 - 2 Years",
        "Key Skills": "Reconciliation| Banking| General Accounting",
        "Location": "Navi Mumbai",
        "Responsibilities": "Align Googlers from multiple organization to deliver outstanding product and program outcomes.\\nDrive the planning and execution of the software development programs, working closely with engineers, product managers, site reliability engineers, and other key stakeholders. Establish goals, schedule and milestones. Proactively manage dependencies and anticipate/resolve execution issues.\\nBe the trusted owner of the status of your releases and programs.\\nDrive visibility on progress/dependencies/risks/issues to executives and other stakeholders.\\nBuild strong partnerships across Google and leverage your credibility and technical acumen to drive process improvements and efficiencies that lead to better quality and increased velocity/productivity."
    },
    {
        "Job ID": 41,
        "Crawl Timestamp": "2020-12-04 19:33:54 +0000",
        "JobTitle": "B2B Sales Manager",
        "Company": "LVMH Moët Hennessy Louis Vuitton",
        "Job Salary": "25,00,000 - 35,00,000 PA.",
        "Job Experience Required": "10 - 20 Years",
        "Key Skills": "B2B Sales| Sales Management| Corporate Sales| corporate marketing",
        "Location": "Gurgaon",
        "Responsibilities": "Design, develop, test, deploy, maintain and improve software.\\nManage individual project priorities, deadlines and deliverables."
    },
    {
        "Job ID": 42,
        "Crawl Timestamp": "2020-11-05 06:58:02 +0000",
        "JobTitle": "HR Executive,",
        "Company": "Honda Motor",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "HR|Recruitment|hiring|talent acquisition|resourcing|HR activities",
        "Location": "Bengaluru",
        "Responsibilities": "Help compile customer requirements as well as survey existing customer IT landscape to enable integrations from PoC stage to a full deployment of products managing healthcare and/or life sciences data in Google Cloud.\\nDefine the business case for solutions, design solutions to help prototype and develop the customer’s new environment, and guide solutions through launch to market. Create training materials, guides, demonstrations and white papers and help scale solutions delivery.\\nEngage standards communities to drive the development of standards that meet platform and customer needs, and ensure that standards implementers know what the Google Cloud Healthcare platform can do for them.\\nDemonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers. Provide customer and market feedback to the Product and Engineering teams and help shape product direction.\\nTravel as required in-region for meetings, technical reviews and onsite delivery activities."
    },
    {
        "Job ID": 43,
        "Crawl Timestamp": "2020-12-04 04:44:06 +0000",
        "JobTitle": "Veeva CRM",
        "Company": "Berkshire Hathaway",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "15 - 20 Years",
        "Key Skills": "Business process|Data modeling|Debugging|Outsourcing|Troubleshooting|Operations|Apex|CRM|Salesforce|Visualforce",
        "Location": "Bengaluru",
        "Responsibilities": "Provide Program Management support to Google Cloud Online Experience projects.\\nProvide operational support for Online Operations including recruiting and space planning.\\nImplement consistent reporting and tracking across Product teams, and track upcoming product launches and milestones .\\nPartner in the development and roll out of communication and on-boarding programs.\\nSupport budget planning and ongoing tracking."
    },
    {
        "Job ID": 44,
        "Crawl Timestamp": "2020-12-06 01:28:57 +0000",
        "JobTitle": "Insurance Head",
        "Company": "GlaxoSmithKline",
        "Job Salary": "35,00,000 - 50,00,000 PA.",
        "Job Experience Required": "10 - 15 Years",
        "Key Skills": "Insurance Sales| mutual funds",
        "Location": "Bengaluru",
        "Responsibilities": "Work as part of the Sales team to identify and qualify platform opportunities. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nLead technical projects including such activities as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work and the coordination of supporting technical resources.\\nWork hands-on with Google for Work Cloud Platform products to demonstrate and prototype integrations in customer/partner environments.\\nPrepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness."
    },
    {
        "Job ID": 45,
        "Crawl Timestamp": "2020-12-04 22:25:08 +0000",
        "JobTitle": "Dot Net Developer",
        "Company": "AXA Group",
        "Job Salary": "7,00,000 - 14,00,000 PA.",
        "Job Experience Required": "4 - 9 Years",
        "Key Skills": "Angularjs| .Net| dot net",
        "Location": "Chennai",
        "Responsibilities": "Support the management of outsourced operations as well as workforce management in EMEA region.\\nAchieve strategic business goals for vendor workforce in terms of customer experience, service levels, quality, delivery of service and cost.\\nMonitor daily performance, collect and analyze data in order to recognize trends and potential issues across key performance metrics.\\nSupport vendor selection, agreements and overall vendor operations strategy, while leading regular business reviews and manage vendor relationships.\\nWork closely with various internal groups to understand business requirements, implement new products or processes, participate in workforce planning and budgeting activities, and contribute to ongoing process improvements."
    },
    {
        "Job ID": 46,
        "Crawl Timestamp": "2020-12-04 23:08:28 +0000",
        "JobTitle": "Job Description",
        "Company": "Commonwealth Bank",
        "Job Salary": "INR 2,25,000 - 2,75,000 PA.",
        "Job Experience Required": "2 - 5 Years",
        "Key Skills": "Internal Audit|Communication Skills|Process Quality|Banking Sales|Auditing|Unsecured Loans",
        "Location": "Bengaluru",
        "Responsibilities": "Produce required design specifications, provide technical leadership and architectural mentorship and help customers build quality technical solutions/implementations with on-premises, cloud and hybrid cloud-based Apigee solution.\\nWork closely with geographically distributed Apigee and Customer project teams to align the technical requirements and the solution design with the customer's business drivers and in order to demonstrate our value.\\nAct as a liaison for the engineering and product teams to commercialize solutions with partners and customers.\\nTravel up to 50% of the time."
    },
    {
        "Job ID": 47,
        "Crawl Timestamp": "2020-11-04 03:47:30 +0000",
        "JobTitle": "Sr. .Net Developer",
        "Company": "Petrobras",
        "Job Salary": "4,00,000 - 6,00,000 PA.",
        "Job Experience Required": "4 - 9 Years",
        "Key Skills": "WCF| ASP.Net| JQuery| MVC| C#| Javascript| SQL Server| .NET Framework| Angularjs| Web Services",
        "Location": "Kolkata (Brabourne road)",
        "Responsibilities": "Manage feature development for graphics modeling and rendering of the robotics simulation system.\\nDrive engineering excellence towards high-quality and highly-stable code.\\nCollaborate with Product and Engineering teams across geographical locations."
    },
    {
        "Job ID": 48,
        "Crawl Timestamp": "2020-11-05 04:40:58 +0000",
        "JobTitle": "Finance Manager",
        "Company": "Rosneft",
        "Job Salary": "3,25,000 - 8,00,000 PA.",
        "Job Experience Required": "3 - 6 Years",
        "Key Skills": "Commercial| Financial Reporting| IT Skills| Financial Risk| Negotiation Skills| Finance| Financial Accounting| Technical Skills| Business Awareness| Financial Management",
        "Location": "Bengaluru",
        "Responsibilities": "Write technical documentation for our external developer audience, such as API reference docs and developer guides.\\nDesign and organize documentation sets for new APIs and developer products.\\nEdit, clarify, and proofread documents written by others, and coach non-writers on ways to improve their writing skills.\\nSupplement developer documentation with relevant sample code."
    },
    {
        "Job ID": 49,
        "Crawl Timestamp": "2020-11-04 12:49:47 +0000",
        "JobTitle": "Dot Net Developer",
        "Company": "Raytheon Technologies",
        "Job Salary": "50,000 - 3,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "c#| asp.net mvc| .net| MVC",
        "Location": "Bengaluru,Chennai",
        "Responsibilities": "Help compile customer requirements as well as survey existing customer IT landscape to enable integrations from PoC stage to a full deployment of products managing healthcare and/or life sciences data in Google Cloud.\\nDefine the business case for solutions, design solutions to help prototype and develop the customer’s new environment, and guide solutions through launch to market. Create training materials, guides, demonstrations and white papers and help scale solutions delivery.\\nEngage standards communities to drive the development of standards that meet platform and customer needs, and ensure that standards implementers know what the Google Cloud Healthcare platform can do for them.\\nDemonstrate thought leadership in cloud computing across multiple channels and become a trusted advisor to decision makers. Provide customer and market feedback to the Product and Engineering teams and help shape product direction.\\nTravel as required in-region for meetings, technical reviews and onsite delivery activities."
    },
    {
        "Job ID": 50,
        "Crawl Timestamp": "2020-11-04 23:24:43 +0000",
        "JobTitle": "Business Analyst",
        "Company": "General Motors",
        "Job Salary": "3,00,000 - 3,50,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "vba| excel| business analysis| problem solving| tableau| mis reporting| variance analysis",
        "Location": "Mumbai (Rajendra Nagar)",
        "Responsibilities": "Support operations and analytic projects related to the capacity planning, allocation, and fulfillment needs for compute, storage, and network resources.\\nWork with partner teams to re-engineer process workflows around demand planning, supply planning, ordering, and fulfillment.\\nWork with engineering to specify requirements and user test plans for software systems to support capacity planning, forecasting, modeling, and resource allocation/distribution.\\nCoordinate projects across functional teams and business units to deliver features and releases within ambitious timelines.\\nPlay a key role in the advancement of strategy, policy, and supporting tools for operations."
    },
    {
        "Job ID": 51,
        "Crawl Timestamp": "2020-12-04 20:16:14 +0000",
        "JobTitle": "Content Writer,",
        "Company": "Royal Dutch Shell",
        "Job Salary": "2,00,000 - 5,00,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "Content Management| creative writer| Content| Content Development| content writing| content developer| content writer| creative content",
        "Location": "Delhi NCR,Noida",
        "Responsibilities": "Work intensively on a project basis with our clients in order to help them solve their measurement and attribution challenges, leading to extensive incremental business growth.\\nWork closely with local Sales teams to open doors for clients. Scale your knowledge to the local Account Team so that they can scale this further to the rest of their accounts.\\nWork closely with the EMEA-wide expert knowledge community to stay updated and contribute to excellent community knowledge. Strive to constantly increase your own knowledge and the knowledge of those around you.\\nBuild a thorough knowledge of how clients and agencies can use Google measurement solutions to meet their marketing objectives."
    },
    {
        "Job ID": 52,
        "Crawl Timestamp": "2020-12-05 08:48:39 +0000",
        "JobTitle": "Network Engineer",
        "Company": "Enel",
        "Job Salary": "2,00,000 - 5,00,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "Network Engineering| Networking| VOIP Engineer",
        "Location": "Mumbai",
        "Responsibilities": "Work closely across multiple teams.\\nDeliver a consistent worldwide strategy for initiatives to support our strategic alliances for energizing the market and ecosystem to partner with Google.\\nBe responsible for the global strategy, core initiative development, and funding programs, and analytics to drive effective partner Go-to-Market initiatives that provide value for our customers and ignite our ecosystem.\\nUnderstand our partnerships, their goals and the intersection with Google’s, design innovative GTM campaigns and evaluate which partners we need to support.\\nGuide regional teams in understanding the initiatives across the Americas, EMEA and JAPAC."
    },
    {
        "Job ID": 53,
        "Crawl Timestamp": "2020-11-05 11:25:57 +0000",
        "JobTitle": "Marketing Head",
        "Company": "Volkswagen Group",
        "Job Salary": "7,00,000 - 15,00,000 PA.",
        "Job Experience Required": "7 - 12 Years",
        "Key Skills": "marketing",
        "Location": "Mumbai (Vasai)",
        "Responsibilities": "Develop, track program plans, consult on solutions to technical problems, and communicate schedule and technical considerations to leadership.\\nSupport Software Technical leads in managing timing risks, bug tracking and conducting software performance analysis.\\nPrioritize activities for quick execution of critical path work items.\\nUnderstand and communicate engineering challenges and project strategy."
    },
    {
        "Job ID": 54,
        "Crawl Timestamp": "2020-11-04 03:41:46 +0000",
        "JobTitle": "Training Manager",
        "Company": "Japan Post Holdings",
        "Job Salary": "3,00,000 - 5,50,000 PA",
        "Job Experience Required": "9 - 14 Years",
        "Key Skills": "Training Delivery| TNI| Training Management| Training Needs| Staff Development| Job Analysis| Team Management| Program Delivery| Operation Team| Design Development",
        "Location": "Noida",
        "Responsibilities": "Work with the team to identify and qualify business opportunities, identify key customer technical objections and develop the strategy to resolve technical impediments.\\nManage the technical relationship with Google’s customers, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources.\\nWork directly with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments.\\nRecommend integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution using best practices on Google Cloud.\\nTravel to customer sites, conferences, and other related events as required."
    },
    {
        "Job ID": 55,
        "Crawl Timestamp": "2020-12-05 04:46:07 +0000",
        "JobTitle": "Gynaec RMO",
        "Company": "Cigna",
        "Job Salary": "3,00,000 - 5,50,000 PA.",
        "Job Experience Required": "0 - 1 Years",
        "Key Skills": "mbbs| MD",
        "Location": "Mumbai",
        "Responsibilities": "Implement, troubleshoot and support complex technical solutions with DoubleClick advertising products to drive customer success and product adoption.\\nUnderstand requirements, provide technical consultation and develop custom technical solutions to meet the complex needs of advertisers.\\nContribute to product development by identifying gaps and deficiencies in current product offerings at a pod or product level to drive both operational efficiencies and business growth, collaborating with client services, product management and engineering teams to drive innovation.\\nBuild strong relationships with the sales team and end advertisers/agencies to understand their key challenges and present/implement scalable technical solution proactively to earn the status of trusted advisor."
    },
    {
        "Job ID": 56,
        "Crawl Timestamp": "2020-12-04 15:39:04 +0000",
        "JobTitle": "Testing Engineer",
        "Company": "Coca-Cola",
        "Job Salary": "2,50,000 - 3,50,000 PA.",
        "Job Experience Required": "2 - 4 Years",
        "Key Skills": "test engineering",
        "Location": "Noida",
        "Responsibilities": "Consult with customers on technical issues based on in-depth product and technical knowledge.\\nDevelop technical tools and documentation to expedite implementations and improve product serviceability.\\nAct as a liaison for the engineering and product teams to commercialize solutions with partners and customers.\\nProvide product solution improvements and market opportunities to Product Managers and Engineering.\\nProvide highly technical implementation support in customer environment, including guidance on implementation feasibility of cross-product integrations."
    },
    {
        "Job ID": 57,
        "Crawl Timestamp": "2020-12-04 08:52:21 +0000",
        "JobTitle": "Big Data Developer",
        "Company": "Merck & Co.",
        "Job Salary": "5,00,000 - 10,00,000 PA.",
        "Job Experience Required": "4 - 6 Years",
        "Key Skills": "Azure| python| Big Data| Tableau| Pig| Hive| R| NoSQL| SCALA| Spark| QlikView| AWS",
        "Location": "Noida",
        "Responsibilities": "Serve as point of contact for Partners and manage consistent and operationally efficient “Partner first” business practices to onboard and support our partners through their partnership lifecycle.\\nUnderstand and propose the necessary systems and process changes to reduce friction for our partners and Sales teams.\\nContribute to the development of existing and future state Partner Onboarding activities and initiatives that develop ongoing touch points with Partners to increase their success with Google Cloud.\\nPromote new initiatives and offers proactively to our partners in a scalable fashion that energizes our partner ecosystem."
    },
    {
        "Job ID": 58,
        "Crawl Timestamp": "2020-12-05 00:54:03 +0000",
        "JobTitle": "Job Description",
        "Company": "BHP Group",
        "Job Salary": "5,00,000 - 10,00,000 PA.",
        "Job Experience Required": "2 - 6 Years",
        "Key Skills": "HR Generalist Activities",
        "Location": "Ahmedabad",
        "Responsibilities": "Work as part of a Sales team to identify and qualify Platform opportunities and determine if Google Cloud Platform is right for them. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nTake responsibility for leading technical projects, including activities such as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources.\\nWork hands-on with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Travel frequently around EMEA as required for meetings, technical reviews and onsite delivery activities.\\nPrepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness."
    },
    {
        "Job ID": 59,
        "Crawl Timestamp": "2020-11-04 03:12:06 +0000",
        "JobTitle": "Senior Accountant",
        "Company": "BMW Group",
        "Job Salary": "3,00,000 - 4,50,000 PA.",
        "Job Experience Required": "8 - 10 Years",
        "Key Skills": "Accounting| Finance| Book Keeping| Vouchers| Financial Reporting| Tally| Payments| Stock Inventory",
        "Location": "Hyderabad (Madhapur)",
        "Responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer technical objections and develop the strategy to resolve technical blockers.\\nProvide in-depth video and media expertise to support the technical relationship with Google’s customers, including product and solution briefings, proof-of-concept work, and partner directly with product management to prioritize solutions impacting customer adoption to Google Cloud.\\nWork hands-on with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments.\\nRecommend integration strategies, enterprise architectures, platforms and application infrastructure required to implement a complete solution using best practices on Google Cloud.\\nTravel to customer sites, conferences, and other related events as required."
    },
    {
        "Job ID": 60,
        "Crawl Timestamp": "2020-12-04 10:58:07 +0000",
        "JobTitle": "CICS Administration",
        "Company": "Nippon Telegraph & Tel",
        "Job Salary": "2,75,000 - 4,00,000 PA.",
        "Job Experience Required": "3 - 8 Years",
        "Key Skills": "Administration|CICS|Mainframes",
        "Location": "Bengaluru",
        "Responsibilities": "Plan and implement the development of New Product Introduction (NPI) builds and ensure these products transition to production according to specific cost, quality and capacity goals.\\nLead cross-functional teams within Google and with external partners to prepare for production ramp and product transitions.\\nDrive ramp readiness with internal teams as well as external partners (i.e. material availability, capacity readiness, transition plans).\\nDrive cross-functional teams to optimize the supply chain for specific strategic reasons, while accounting for risks, changes in schedule or demand.\\nProvide support for products in a sustaining environment."
    },
    {
        "Job ID": 61,
        "Crawl Timestamp": "2020-12-05 01:45:00 +0000",
        "JobTitle": "IT - Exceutive",
        "Company": "MetLife",
        "Job Salary": "1,50,000 - 3,25,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "payroll software| security| access control| networking| cctv| office 365",
        "Location": "Delhi NCR",
        "Responsibilities": "Work with the team to identify and qualify business opportunities, understand key customer technical objections and develop the strategy to resolve technical blockers.\\nProvide in-depth video and media expertise to support the technical relationship with Google’s customers, including product and solution briefings, proof-of-concept work, and partner directly with product management to prioritize solutions impacting customer adoption to Google Cloud.\\nWork hands-on with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments.\\nRecommend integration strategies, enterprise architectures, platforms and application infrastructure required to implement a complete solution using best practices on Google Cloud.\\nTravel to customer sites, conferences, and other related events as required."
    },
    {
        "Job ID": 62,
        "Crawl Timestamp": "2020-11-04 09:59:27 +0000",
        "JobTitle": "Operation Manager",
        "Company": "Nippon Telegraph & Tel",
        "Job Salary": "2,75,000 - 4,00,000 PA.",
        "Job Experience Required": "2 - 5 Years",
        "Key Skills": "Management| Administration| Team Handling| team management| Operations",
        "Location": "Delhi NCR,Gurgaon,jajjhar",
        "Responsibilities": "Build consistent offerings to energize the market and ecosystem to partner with Google.\\nDesign a compelling partner experience and management model for ensuring our partners are provided an effective partner experience invested in their growth with GCP.\\nOversee on-line communities, Partner Advisory Councils and focus groups."
    },
    {
        "Job ID": 63,
        "Crawl Timestamp": "2020-12-04 17:33:12 +0000",
        "JobTitle": "BPM Developer",
        "Company": "Microsoft",
        "Job Salary": "3,00,000 - 4,50,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "Rest|Core Java|Ibm Bpm|MS SQL|SOA|ESB|business process management|Javascript|SOAP|Web Services|Microservices|Bpm",
        "Location": "Hyderabad",
        "Responsibilities": "Collaborate with Sales/Partner leads and technical stakeholders to translate complex customer requirements into recommendations for appropriate solution architectures.\\nWork with customer technical leads, client executives and partners to manage and deliver successful migrations to cloud solutions.\\nCreate programs and template solutions to achieve scalable impact across the customer and partner ecosystem.\\nUnderstand customer needs and help to shape Google’s long-term product strategy.\\nTravel internationally up to 30% of the time to clients and customer's locations."
    },
    {
        "Job ID": 64,
        "Crawl Timestamp": "2020-12-04 03:22:16 +0000",
        "JobTitle": "Accounts Executive",
        "Company": "Bank of America",
        "Job Salary": "1,25,000 - 2,25,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "ms excel| accounting| ms word| MS Office| finance",
        "Location": "Bengaluru",
        "Responsibilities": "Deliver high-quality solutions including sample code and solve complex technical customer challenges.\\nBe a trusted strategic technical advisor to Google's strategic customers.\\nIdentify new product features and feature gaps, provide guidance on existing product issues, and collaborate with Product Managers and engineers to influence the strategy of Google Cloud Platform.\\nDeliver best practices recommendations, tutorials, blog articles and technical presentations adapting to different levels of business and technical stakeholders.\\nTravel up to 30% of the time."
    },
    {
        "Job ID": 65,
        "Crawl Timestamp": "2020-12-04 18:46:19 +0000",
        "JobTitle": "Dot Net Developer",
        "Company": "Bank of Nova Scotia",
        "Job Salary": "4,00,000 - 7,00,000 PA.",
        "Job Experience Required": "5 - 8 Years",
        "Key Skills": "C#|Software Development Life Cycle|Communication Skills|Customer Service|SOA|Written Communication|ASP.Net|Scrum|SQL Server|Web Services",
        "Location": "Noida",
        "Responsibilities": "Manage a cross-functional team of electrical engineers, product design engineers, and program managers.\\nGuide the team through the architecture definition and product development process, by mentoring and participation in design reviews.\\nWork closely with the product management, operations, and quality teams to ensure we're building high quality products.\\nManage the overall planning, execution, and success of multiple complex consumer hardware programs.\\nBuild consensus among cross-functional teams and influence decision making with senior-level audiences."
    },
    {
        "Job ID": 66,
        "Crawl Timestamp": "2020-12-04 16:56:17 +0000",
        "JobTitle": "Python Developer",
        "Company": "Brookfield Asset Management",
        "Job Salary": "1,25,000 - 2,25,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "Business process|Prototype|Django|MySQL|Algorithm development|Product design|MongoDB|Outsourcing|Operations|Python",
        "Location": "Bengaluru",
        "Responsibilities": "Develop simulation models at different abstraction levels (Cycle Accurate/TLM/Functional).\\nBuild models for SoC components like processors, video codec, machine learning accelerator, memory subsystem, bus interconnect, and other peripherals.\\nPerform system level modeling for SoC architecture and performance exploration and analysis."
    },
    {
        "Job ID": 67,
        "Crawl Timestamp": "2020-12-04 07:02:12 +0000",
        "JobTitle": "Chef De Partie",
        "Company": "Goldman Sachs Group",
        "Job Salary": "2,75,000 - 4,00,000 PA.",
        "Job Experience Required": "4 - 8 Years",
        "Key Skills": "continental cuisine",
        "Location": "Mumbai,Mumbai Suburbs,Navi Mumbai",
        "Responsibilities": "Communicate with customers via phone and email.\\nProvide strategic advice and consultation to help our advertisers get the best experience from our advertising products.\\nImplement creative ways to improve customer relationships. Tailor and share online marketing strategy suggestions.\\nWork towards strategic goals, while prioritizing and delivering an outstanding customer experience for Google's advertisers."
    },
    {
        "Job ID": 68,
        "Crawl Timestamp": "2020-11-04 13:08:47 +0000",
        "JobTitle": "HR Executive",
        "Company": "Itaú Unibanco Holding",
        "Job Salary": "1,00,000 - 2,00,000 PA.",
        "Job Experience Required": "0 - 2 Years",
        "Key Skills": "non it recruitment| recruitment| Recruitment Executive| Job Posting| Consultancy",
        "Location": "Noida (Sector-27 Noida) ,Delhi (1) ,...More",
        "Responsibilities": "Work with Partner Managers to identify and recruit partners in the market that can deliver innovative solutions to our customers, built on top of Google Cloud (Google Cloud Platform and G Suite).\\nDevelop our partners’ technical teams with both sales and technical competencies, so that they can be successful in the market.\\nKeep partners up-to-date with product and technical knowledge and market differentiators.\\nWork with partner technical representatives in opportunities and projects, complementing their skill and guaranteeing high quality customer deliverables. Advise on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers and partners to optimize Google Cloud effectiveness.\\nAct as a technical advocate within Google for our partners in order to help provide feedback from the field, as well as to present on their behalf."
    },
    {
        "Job ID": 69,
        "Crawl Timestamp": "2020-11-05 06:51:01 +0000",
        "JobTitle": "Jobs",
        "Company": "Total",
        "Job Salary": "5,00,000 - 10,00,000 PA.",
        "Job Experience Required": "4 - 8 Years",
        "Key Skills": "Bengaluru/Bangalore|Delhi/NCR|Gurgaon|Kolkata|Other National Locations|Mumbai|Pune|Delhi|Software Developer|System Analyst|Testing Engineer|Team Lead/Technical Lead|Project Lead|Outside Consultant|Fresher|Trainee|Trainee|Network Administrator|System Administrator|Technical Support Engineer|Associate/Senior Associate |Associate/Senior Associate |Assistant Manager/Manager |Assistant Manager/Manager|Assistant Manager/Manager|Associate/Senior Associate |Project Manager-IT/Software|Financial Analyst|Quality Assurance/Quality Control Manager|Sales/Business Development Manager|Regional Manager|Client Servicing/Key Account Manager|Functional Outside Consultant|Solution Architect / Enterprise Architect|Network Planning Engineer|Senior Outside Consultant|Business/EDP Analyst|Operations Manager|IT Software - Application Programming, Maintenance|ITES, BPO, KPO, LPO, Customer Service, Operations|IT Software - Network Administration, Security|IT Software - System Programming|Sales, Retail, Business Development|IT Software - DBA, Datawarehousing|IT Software - QA & Testing|IT Software - Telecom Software|Accounts, Finance, Tax, Company Secretary, Audit|Strategy, Management Consulting, Corporate Planning|Production, Manufacturing, Maintenance|IT Software - ERP, CRM|IT Hardware, Technical Support, Telecom Engineering|IT-Software, Software Services|BPO, Call Centre, ITeS|Telcom, ISP|Bengaluru/Bangalore|Delhi/NCR|Gurgaon|Kolkata|Other National Locations|Mumbai|Pune|Delhi|Software Developer|System Analyst|Testing Engineer|Team Lead/Technical Lead|Project Lead|Outside Consultant|Fresher|Trainee|Trainee|Network Administrator|System Administrator|Technical Support Engineer|Associate/Senior Associate |Associate/Senior Associate |Assistant Manager/Manager |Assistant Manager/Manager|Assistant Manager/Manager|Associate/Senior Associate |Project Manager-IT/Software|Financial Analyst|Quality Assurance/Quality Control Manager|Sales/Business Development Manager|Regional Manager|Client Servicing/Key Account Manager|Functional Outside Consultant|Solution Architect / Enterprise Architect|Network Planning Engineer|Senior Outside Consultant|Business/EDP Analyst|Operations Manager|IT Software - Application Programming, Maintenance|ITES, BPO, KPO, LPO, Customer Service, Operations|IT Software - Network Administration, Security|IT Software - System Programming|Sales, Retail, Business Development|IT Software - DBA, Datawarehousing|IT Software - QA & Testing|IT Software - Telecom Software|Accounts, Finance, Tax, Company Secretary, Audit|Strategy, Management Consulting, Corporate Planning|Production, Manufacturing, Maintenance|IT Software - ERP, CRM|IT Hardware, Technical Support, Telecom Engineering|IT-Software, Software Services|BPO, Call Centre, ITeS|Telcom, ISP",
        "Location": "",
        "Responsibilities": "Support and partner with Sales in order to provide technical and functional assessments for prospective clients.\\nCreate an efficient cross-product onboarding experience for the client, ensuring excellent service and consulting to assure a future proof setup of their advertising infrastructure.\\nMaintain relationships with agency, advertiser, and trading desk clients providing high-touch, solutions-oriented service from a technical and functional perspective.\\nManage reactive client issues sent to Technical Services Associate teams and act as a point of escalation when support teams need assistance.\\nManage activities including workshops with agencies and advertiser stakeholders to surface and match business needs with the platform's functionality, training plans, tagging and reporting implementation consultancy and implementation project management."
    },
    {
        "Job ID": 70,
        "Crawl Timestamp": "2020-12-04 10:17:23 +0000",
        "JobTitle": "Business Analyst",
        "Company": "UnitedHealth Group",
        "Job Salary": "1,25,000 - 2,50,000 PA.",
        "Job Experience Required": "0 - 2 Years",
        "Key Skills": "Customer Relationship| Business Requirement Analysis| Project Management| Requirement Gathering| business strategy| System Analysis| business analysis| Quality Assurance| Business Consultant",
        "Location": "Ahmedabad",
        "Responsibilities": "Help partners in their day-to-day challenges by delivering innovative and scalable solutions to their problems, troubleshooting their issues and performing implementation reviews. Advocate new product features and ensure the prompt and proper resolution of technical challenges.\\nAssist clients in the adoption of new products via upgrades and migrations to develop their long term success and improve product offerings by providing client feedback on features to Product Management and Engineering.\\nGuarantee the technical aspects of client integrations (both new and ongoing) by providing necessary documentation and technical guidance.\\nPresent in front of small or mid-sized groups of internal stakeholders and customers.\\nAnalyze and optimize the development of existing clients to ensure their success with the Google suite of products for partners."
    },
    {
        "Job ID": 71,
        "Crawl Timestamp": "2020-11-04 05:47:39 +0000",
        "JobTitle": "Java Developer",
        "Company": "Sumitomo Mitsui Financial",
        "Job Salary": "2,00,000 - 6,50,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "java| core java| servlets| jsp| spring| hibernate| mysql| j2ee| struts| OOPS| design patterns| multithreading| algorithms| data structures",
        "Location": "Delhi (Asiad village)",
        "Responsibilities": "Manage a high-performing team of trusted advisors to deliver consultative technical services to Google’s largest advertisers.\\nDevelop and execute consulting strategies that deliver quality and efficiency at scale.\\nCreate a culture of collaboration, communication and inclusiveness.\\nWork with Sales, Product Management and Engineering to bring new products to market and ensure strategic alignment with customer needs.\\nSurface metrics and insights that drive our processes and demonstrate credible impact of our work. Automate complex workflows and processes to drive greater quality and efficiency."
    },
    {
        "Job ID": 72,
        "Crawl Timestamp": "2020-12-05 04:50:56 +0000",
        "JobTitle": "Accountant",
        "Company": "MetLife",
        "Job Salary": "1,75,000 - 2,25,000 PA.",
        "Job Experience Required": "1 - 3 Years",
        "Key Skills": "Bcom| Salary| B| Accounting",
        "Location": "Mumbai",
        "Responsibilities": "Provide consulting services, share best practices and conduct technical troubleshooting for clients.\\nWork with core teams to develop strategy, including best practices, change management and optimization analysis.\\nImplement new product features as they relate to client product usage.\\nCollaborate with the regional and global Sales and Services teams to lead monitoring exchange activity efforts and to track performance against goals.\\nEnsure project team, internal management and external customers receive appropriate, timely and accurate project information and status updates, identifying delays, budgets and technical quality concerns so that they can be proactively addressed."
    },
    {
        "Job ID": 73,
        "Crawl Timestamp": "2020-11-04 23:47:11 +0000",
        "JobTitle": "Sr. Sales Officer",
        "Company": "Honda Motor",
        "Job Salary": "1,50,000 - 2,00,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "MIS Reporting| Sales Executive| sales officer| Coordination",
        "Location": "Hyderabad",
        "Responsibilities": "Help partners in their day-to-day challenges by delivering innovative and scalable solutions to their problems, troubleshooting their issues and performing implementation reviews. Advocate new product features and ensure the prompt and proper resolution of technical challenges.\\nAssist clients in the adoption of new products via upgrades and migrations to develop their long term success and improve product offerings by providing client feedback on features to Product Management and Engineering.\\nGuarantee the technical aspects of client integrations (both new and ongoing) by providing necessary documentation and technical guidance.\\nPresent in front of small or mid-sized groups of internal stakeholders and customers.\\nAnalyze and optimize the development of existing clients to ensure their success with the Google suite of products for partners."
    },
    {
        "Job ID": 74,
        "Crawl Timestamp": "2020-11-04 05:09:40 +0000",
        "JobTitle": "Spring Boot",
        "Company": "Siemens",
        "Job Salary": "2,00,000 - 6,50,000 PA.",
        "Job Experience Required": "3 - 5 Years",
        "Key Skills": "SQL|Javascript|HTML|Hibernate|jQuery|Business process|Outsourcing|test driven development|Software development life cycle|Operations",
        "Location": "Hyderabad",
        "Responsibilities": "Work closely across multiple teams.\\nDeliver a consistent worldwide strategy for initiatives to support our strategic alliances for energizing the market and ecosystem to partner with Google.\\nBe responsible for the global strategy, core initiative development, and funding programs, and analytics to drive effective partner Go-to-Market initiatives that provide value for our customers and ignite our ecosystem.\\nUnderstand our partnerships, their goals and the intersection with Google’s, design innovative GTM campaigns and evaluate which partners we need to support.\\nGuide regional teams in understanding the initiatives across the Americas, EMEA and JAPAC."
    },
    {
        "Job ID": 75,
        "Crawl Timestamp": "2020-12-04 11:19:27 +0000",
        "JobTitle": "Job Description",
        "Company": "TD Bank Group",
        "Job Salary": "2,00,000 - 7,00,000 PA.",
        "Job Experience Required": "5 - 8 Years",
        "Key Skills": "Hive|Linux|Hadoop|Cloud|Hdfs|Spark|Clustering|YARN|AWS|Devops",
        "Location": "Hyderabad",
        "Responsibilities": "Design a compelling portfolio of technical trainings, tools, resources, incentives, product roadmaps and white space analysis for partners.\\nBuild a model to ensure our partners are provided the guidance and expertise to be incredibly knowledgeable with GCP.\\nBuild consistent offerings to energize the market and ecosystem to partner with Google."
    },
    {
        "Job ID": 76,
        "Crawl Timestamp": "2020-12-06 03:00:18 +0000",
        "JobTitle": "R&D Engineer",
        "Company": "Cigna",
        "Job Salary": "3,00,000 - 4,50,000 PA.",
        "Job Experience Required": "3 - 6 Years",
        "Key Skills": "Design Development| USB| RS485| RS232| Embedded Systems| ARM| LCD",
        "Location": "Delhi NCR",
        "Responsibilities": "Create awareness and momentum, and drive the success of Google’s Cloud Platform through your interactions with third party developers building applications.\\nAdvocate the adoption of Google Cloud Platform to strategic partners and the broader developer community.\\nParticipate in technical and design discussions with technical executives, acting as strategic partners to speed adoption and ensure best practices during implementation.\\nAdvocate for our developer products in person and online by presenting at conferences, blogging, developing videos, writing technical tutorials and conducting other similar activities.\\nAdvocate for developers internally and influence Google developer product strategy by working with Product Management, Engineering, PR, Marketing, Business Development and other cross-functional teams."
    },
    {
        "Job ID": 77,
        "Crawl Timestamp": "2020-11-07 00:43:41 +0000",
        "JobTitle": "Big Data Architect",
        "Company": "RBC",
        "Job Salary": "9,00,000 - 18,00,000 PA.",
        "Job Experience Required": "5 - 10 Years",
        "Key Skills": "Bcom| Salary| B| Accounting",
        "Location": "Bengaluru",
        "Responsibilities": "Work closely with our Sales team. Identify, develop, and optimize new business opportunities and develop client relationships by leveraging Google products and technologies. Develop cutting-edge solutions as the technical lead, provide consulting services to our partners, build lasting relationships and be sensitive to client needs.\\nHelp partners in their day-to-day challenges by delivering innovative and scalable solutions and troubleshooting their technical issues.\\nPropose, design, create and present prototypes, demos and proofs-of-concept to a wide variety of audiences, from engineers to marketing professionals.\\nPerform implementation reviews. Advocate for new product features, and provide partner feedback to internal cross-functional teams including Product Management and Engineering.\\nTravel as required to meet with specific partners/clients across the world."
    },
    {
        "Job ID": 78,
        "Crawl Timestamp": "2020-12-05 23:46:54 +0000",
        "JobTitle": "Great Opportunity",
        "Company": "Gazprom",
        "Job Salary": "6,50,000 - 13,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "Senior Resident| Gynecology| Doctor",
        "Location": "Delhi,Delhi NCR",
        "Responsibilities": "Build next-generation web applications with a focus on the client side.\\nRedesign UI's, Implement new UI's, and pick up Java as necessary.\\nEngage with back-end systems."
    },
    {
        "Job ID": 79,
        "Crawl Timestamp": "2020-12-04 15:42:21 +0000",
        "JobTitle": "Hiring For Sales",
        "Company": "Pfizer",
        "Job Salary": "2,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 6 Years",
        "Key Skills": "Channel Partners| Team Management| Lead Generation| Negotiation Skills| Sales Achievement| Real Estate| Marketing Collaterals| Cold Calling| Channel Sales| Business Development",
        "Location": "Noida",
        "Responsibilities": "Become a trusted technical advisor to customers and overcome complex implementation challenges.\\nCreate and deliver best practice recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders.\\nTravel up to 30% of the time in-region for meetings, technical reviews and onsite delivery activities."
    },
    {
        "Job ID": 80,
        "Crawl Timestamp": "2020-11-06 10:05:11 +0000",
        "JobTitle": "Data Scientist",
        "Company": "Gazprom",
        "Job Salary": "13,00,000 - 19,00,000 PA.",
        "Job Experience Required": "5 - 9 Years",
        "Key Skills": "SAS| Hadoop| R| Hive| SQL| Machine Learning| Time Series| Big Data Analytics| Predictive Modeling| Statistics",
        "Location": "Bengaluru",
        "Responsibilities": "Work with internal Sales and external Partner teams to present business solutions/configurations.\\nServe as a central coordination point for customer bugs and issues escalated by internal Sales teams.\\nParticipate in enabling the Google Partner community through the development of technical tools and documentation to expedite customer deployment and improve product serviceability.\\nProvide product solution improvements and market opportunities to Product Managers and Engineering teams.\\nTravel up to 50% of the time domestically and internationally."
    },
    {
        "Job ID": 81,
        "Crawl Timestamp": "2020-12-04 05:23:10 +0000",
        "JobTitle": "Content Writer",
        "Company": "Saudi Arabian Oil Company (Saudi Aramco)",
        "Job Salary": "1,50,000 - 3,00,000 PA.",
        "Job Experience Required": "1 - 4 Years",
        "Key Skills": "copy editor| language editor| Campaigns| content editor| seo| Content Writing| content developer| Proof reading| editing",
        "Location": "Mumbai",
        "Responsibilities": "Work with Android Camera team, develop cutting-edge image processing algorithms in C++\\nDesign, implement and optimize algorithms turning them into low-power custom hardware using high-level synthesis"
    },
    {
        "Job ID": 82,
        "Crawl Timestamp": "2020-11-04 07:03:34 +0000",
        "JobTitle": "Scrum Master",
        "Company": "ExxonMobil",
        "Job Salary": "2,00,000 - 7,00,000 PA.",
        "Job Experience Required": "8 - 11 Years",
        "Key Skills": "Java|Oracle|Scrum Master|Project Execution|Communication Skills",
        "Location": "Bengaluru",
        "Responsibilities": "Create automation tools for Cadence Concept and Allegro using Cadence SKILL coding language.\\nDevelop command line scripts to automate interfacing and data exchange across PCB design, schematic design and simulation tools.\\nDevelop scripts as a workaround for bugs and tool deficiencies for various EDS tools.\\nAutomate deployment of various design tools across the organization."
    },
    {
        "Job ID": 83,
        "Crawl Timestamp": "2020-11-04 18:31:14 +0000",
        "JobTitle": "SAP Consultant",
        "Company": "LVMH Moët Hennessy Louis Vuitton",
        "Job Salary": "5,00,000 - 11,00,000 PA.",
        "Job Experience Required": "3 - 8 Years",
        "Key Skills": "sap consulting| sd| mm| pp| abap| hana| sap fico| SAP CO| SAP ABAP| SAP Basis| SAP SD| SAP MM| SAP PP",
        "Location": "Mumbai",
        "Responsibilities": "Manage a team of Program Managers and Technical Program Managers who lead M&A projects. Assign people and resources to specific M&A transactions, provide guidance and mentorship.\\nManage a portfolio of technology M&A programs - schedule, deliverables, cost and resources.\\nManage and drive improvements to the M&A Technology integration framework. Improve project management processes and drive efficiencies.\\nBuild and manage relationships with technology cross-functional partners/service providers."
    },
    {
        "Job ID": 84,
        "Crawl Timestamp": "2020-11-05 20:28:17 +0000",
        "JobTitle": "Marketing Director",
        "Company": "China Mobile",
        "Job Salary": "15,00,000 - 25,00,000 PA.",
        "Job Experience Required": "5 - 10 Years",
        "Key Skills": "marketing strategy| campaigns| digital marketing| marketing communication| b2b marketing| events| go - to - market strategy| pr",
        "Location": "Mumbai",
        "Responsibilities": "Collaborate with Sales and Customer Engineering management to determine proper territory coverage and staffing levels to support partner technical enablement activities. Develop job requisitions, assemble candidate pool and lead interviews.\\nAssess PSE team’s go-to-market readiness, identify gaps in PSE preparedness, and build plans to ensure the PSE team is properly trained and equipped to successfully perform in support of strategic goals.\\nWork with Google Cloud Partners leadership to identify, qualify, and prioritize joint market opportunities. Participate in periodic business plan review meetings providing insight into how to best achieve strategic goals.\\nWork with the sales account, customer support, product management, customer solutions, and engineering teams to resolve product problems affecting pre- and post-sales partner satisfaction.\\nTravel as required to visit partners/customers across a defined geographic territory."
    },
    {
        "Job ID": 85,
        "Crawl Timestamp": "2020-11-04 21:56:58 +0000",
        "JobTitle": "C/c++ Developer",
        "Company": "Commonwealth Bank",
        "Job Salary": "20,00,000 - 35,00,000 PA.",
        "Job Experience Required": "8 - 13 Years",
        "Key Skills": "c++| c",
        "Location": "Hyderabad",
        "Responsibilities": "Manage feature development for cloud software integration of the robotics simulation system.\\nDrive engineering excellence towards high-quality and highly-stable code.\\nCollaborate with Product and Engineering teams across geographical locations."
    },
    {
        "Job ID": 86,
        "Crawl Timestamp": "2020-12-04 05:34:13 +0000",
        "JobTitle": "Cafe Incharge",
        "Company": "American Express",
        "Job Salary": "1,50,000 - 2,50,000 PA.",
        "Job Experience Required": "0 - 3 Years",
        "Key Skills": "center management| food products| inventory management| cafe management| sales",
        "Location": "Delhi NCR",
        "Responsibilities": "Partner with cross-functional stakeholders to achieve the team vision and strategy\\nProvide thought leadership for a group of Account Abuse Analysts in an innovative and fast-paced environment.\\nManage a team of Account Analysts and play a key role in developing the abuse/spam vision and strategy for your particular workflow(s).\\nLead and participate in special projects/initiatives: innovate and implement large-scale quality improvements, conduct data analyses and making recommendations, troubleshooting technical issues, help drive product requirements and expansion, and evaluate potential impact of new product features."
    },
    {
        "Job ID": 87,
        "Crawl Timestamp": "2020-11-04 06:36:43 +0000",
        "JobTitle": "SAP HCM Payroll",
        "Company": "TD Bank Group",
        "Job Salary": "6,50,000 - 13,00,000 PA.",
        "Job Experience Required": "5 - 6 Years",
        "Key Skills": "Payroll|Data migration|Recruitment|Business process|Backend|Outsourcing|Loans|Talent management|Operations|Claims",
        "Location": "Gurgaon",
        "Responsibilities": "Work with Partner Managers to identify and recruit partners in the market that can deliver innovative solutions to our customers, built on top of Google Cloud (Google Cloud Platform and G Suite).\\nDevelop our partners’ technical teams with both sales and technical competencies, so that they can be successful in the market.\\nKeep partners up-to-date with product and technical knowledge and market differentiators.\\nWork with partner technical representatives in opportunities and projects, complementing their skill and guaranteeing high quality customer deliverables. Advise on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers and partners to optimize Google Cloud effectiveness.\\nAct as a technical advocate within Google for our partners in order to help provide feedback from the field, as well as to present on their behalf."
    },
    {
        "Job ID": 88,
        "Crawl Timestamp": "2020-12-04 18:02:25 +0000",
        "JobTitle": "Typist",
        "Company": "Comcast",
        "Job Salary": "2,00,000 - 3,00,000 PA.",
        "Job Experience Required": "2 - 3 Years",
        "Key Skills": "stenographer| Excel| Computer Operating| typing| file system| Typist| English Typing| shorthand| Data Entry| Data Entry Operation",
        "Location": "Mumbai",
        "Responsibilities": "Build in collaboration with the Corporate Engineering, Google Cloud Product Areas and Cloud Marketing teams a top Partner to Partner exchange that scales as Google Cloud grows and leverage and showcases the technologies that make Google, “Google.”\\nDevelop processes and provide governance on data accuracy and maintaining data for the PRM.\\nLead the business design and requirements of a Partner Relationship Management (PRM) Solution and implementation.\\nInfluence and work with Corporate Engineering and Product Areas to sunset existing partner stored location and migrate to a central PRM."
    },
    {
        "Job ID": 89,
        "Crawl Timestamp": "2020-11-04 19:57:55 +0000",
        "JobTitle": "HR & Legal Manager",
        "Company": "MetLife",
        "Job Salary": "3,00,000 - 4,75,000 PA.",
        "Job Experience Required": "2 - 4 Years",
        "Key Skills": "Legal Management| HR| Recruitment| HR Manager| Senior HR Executive",
        "Location": "Mumbai (Sakinaka)",
        "Responsibilities": "Write technical documentation for our external developer audience, such as API reference docs and developer guides.\\nDesign and organize documentation sets for new APIs and developer products.\\nEdit, clarify, and proofread documents written by others, and coach non-writers on ways to improve their writing skills.\\nSupplement developer documentation with relevant sample code."
    },
    {
        "Job ID": 90,
        "Crawl Timestamp": "2020-11-05 19:40:08 +0000",
        "JobTitle": "Product Specialist",
        "Company": "Gazprom",
        "Job Salary": "7,00,000 - 10,00,000 PA.",
        "Job Experience Required": "8 - 13 Years",
        "Key Skills": "Product Sales| Concept Selling| Distribution| Customer Service",
        "Location": "Mumbai",
        "Responsibilities": "Develop all aspects of Field Programmable Gate Array (FPGA) implementation, with emphasis on design partitioning, synthesis, place and route, timing analysis, third-party IP integration, RTL simulation, and system level debugging.\\nDrive block and full-chip level FPGA implementation and FPGA QoR (timing, capacity)."
    },
    {
        "Job ID": 91,
        "Crawl Timestamp": "2020-12-04 06:44:38 +0000",
        "JobTitle": "Regional Manager",
        "Company": "Samsung Electronics",
        "Job Salary": "4,25,000 - 9,25,000 PA.",
        "Job Experience Required": "4 - 9 Years",
        "Key Skills": "Regional Management| direct marketing| Region| business development| sales marketing| sales| Marketing| direct sales",
        "Location": "Bengaluru,Delhi NCR,Hyderabad",
        "Responsibilities": "Manage the Instructor Led Training partner business across the Americas to ensure that our training is achieving business objectives as would be expected given size of market; this includes identifying, recruiting, onboarding and managing local training partners.\\nWork with partners to create training business plans and manage their performance against those plans and against standard training partner metrics. Work with the local marketing team to drive training demand for our partners.\\nBe responsible for local roll out of any global initiatives or launches in particular partner focused campaigns; for example, ensure local training partners are aware of new courses, train the trainer sessions, etc.\\nWork with relevant Google Cloud field teams to ensure they are effectively using Instructor Led Training with their customers and facilitate cross-collaboration between our training partners and those teams.\\nIdentify opportunities for, and support the development of, cross-collaboration between our training partners and other Google Cloud partners."
    },
    {
        "Job ID": 92,
        "Crawl Timestamp": "2020-11-06 07:49:53 +0000",
        "JobTitle": "Java Developer",
        "Company": "PepsiCo",
        "Job Salary": "2,00,000 - 7,00,000 PA.",
        "Job Experience Required": "1 - 4 Years",
        "Key Skills": "software development| software developer| java| j2ee| Spring| Structs| Hibernate",
        "Location": "Bengaluru",
        "Responsibilities": ""
    },
    {
        "Job ID": 93,
        "Crawl Timestamp": "2020-11-05 08:27:46 +0000",
        "JobTitle": "Purchase Manager",
        "Company": "Total",
        "Job Salary": "3,75,000 - 6,50,000 PA.",
        "Job Experience Required": "5 - 9 Years",
        "Key Skills": "Accounting| Sales Tax| Taxation| Purchase Management| Procurement| Budgeting| New Product",
        "Location": "Greater Noida (Kasna)",
        "Responsibilities": "Work as part of the Sales team to identify and qualify Platform opportunities and determine if Google Cloud Platform is right for them. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.\\nTake responsibility for leading the technical project including such activities as technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources.\\nPrepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents.\\nMake recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness.\\nTravel regularly in EMEA for meetings, technical reviews and onsite delivery activities."
    },
    {
        "Job ID": 94,
        "Crawl Timestamp": "2020-12-04 11:35:21 +0000",
        "JobTitle": "Apttus Solutions",
        "Company": "Wells Fargo",
        "Job Salary": "4,25,000 - 9,25,000 PA.",
        "Job Experience Required": "3 - 7 Years",
        "Key Skills": "Business process|Manager Technology|Outsourcing|Management|Business applications|Operations|Salesforce",
        "Location": "Chennai",
        "Responsibilities": "Work with architects, logic designers and ASIC vendors to drive architectural feasibility studies, develop timing, power and area design targets, and explore RTL/design tradeoffs for physical design closure.\\nWork with logic verification, and software teams to understand and implement the design requirements for clocking and power management."
    },
    {
        "Job ID": 95,
        "Crawl Timestamp": "2020-12-04 05:59:44 +0000",
        "JobTitle": "Operation Manager",
        "Company": "Roche Holding",
        "Job Salary": "1,50,000 - 2,50,000 PA.",
        "Job Experience Required": "1 - 5 Years",
        "Key Skills": "Grievance Handling| branch sales manager| employee relations| employee engagement| Operations Manager| branch operations manager",
        "Location": "Kolkata",
        "Responsibilities": "Work with Partner Managers to identify and recruit partners in the market that can deliver innovative solutions to our customers, built on top of Google Cloud (Google Cloud Platform and G Suite).\\nDevelop our partners’ technical teams with both sales and technical competencies, so that they can be successful in the market.\\nKeep partners up-to-date with product and technical knowledge and market differentiators.\\nWork with partner technical representatives in opportunities and projects, complementing their skill and guaranteeing high quality customer deliverables. Advise on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers and partners to optimize Google Cloud effectiveness.\\nAct as a technical advocate within Google for our partners in order to help provide feedback from the field, as well as to present on their behalf."
    },
    {
        "Job ID": 96,
        "Crawl Timestamp": "2020-11-04 08:39:10 +0000",
        "JobTitle": "office coordinator",
        "Company": "Nestlé",
        "Job Salary": "70,000 - 1,25,000 PA.",
        "Job Experience Required": "0 - 1 Years",
        "Key Skills": "Office Coordination",
        "Location": "Chandigarh",
        "Responsibilities": "Work closely across multiple teams.\\nDeliver a consistent worldwide strategy for initiatives to support our strategic alliances for energizing the market and ecosystem to partner with Google.\\nBe responsible for the global strategy, core initiative development, and funding programs, and analytics to drive effective partner Go-to-Market initiatives that provide value for our customers and ignite our ecosystem.\\nUnderstand our partnerships, their goals and the intersection with Google’s, design innovative GTM campaigns and evaluate which partners we need to support.\\nGuide regional teams in understanding the initiatives across the Americas, EMEA and JAPAC."
    },
    {
        "Job ID": 97,
        "Crawl Timestamp": "2020-12-05 19:41:45 +0000",
        "JobTitle": "Sales Manager",
        "Company": "Amazon",
        "Job Salary": "3,50,000 - 7,50,000 PA.",
        "Job Experience Required": "3 - 8 Years",
        "Key Skills": "Team Handling| Banca| Life Insurance| Cross Selling| Direct Sales| Sales Management",
        "Location": "Bengaluru,Visakhapatnam",
        "Responsibilities": "Drive regular releases of software solutions for a variety of clients including custom hardware.\\nEnsure alignment between engineering, product, UX and test on release goals and timeline.\\nDefine work planning, scheduling and tracking process and keep the team on track.\\nAnalyze data from trials, customer feedback and QA reports to help the team make the right prioritization, requirements and launch decisions.\\nDocument best practices for software development across multiple project teams and help leads implement them."
    },
    {
        "Job ID": 98,
        "Crawl Timestamp": "2020-12-04 07:08:07 +0000",
        "JobTitle": "Creative Director",
        "Company": "Pfizer",
        "Job Salary": "9,00,000 - 12,00,000 PA.",
        "Job Experience Required": "6 - 9 Years",
        "Key Skills": "Java| Art| Team Training| Data Structures| Spring Boot| Indesign| Microservices| Marketing| Design| Algorithms| Brand Development| Illustrator| Organization Skills| Photoshop| Graphic Designing",
        "Location": "Noida",
        "Responsibilities": "Develop and execute CPU commodity, component, and module strategies for Consumer Hardware. Continually identify and implement new opportunities for Cost Savings and Cost Avoidance including optimizing the supply base for Google’s Consumer Hardware needs."
    },
    {
        "Job ID": 99,
        "Crawl Timestamp": "2020-11-04 07:02:24 +0000",
        "JobTitle": "CGM (HR)",
        "Company": "CITIC",
        "Job Salary": "4,25,000 - 9,25,000 PA.",
        "Job Experience Required": "0 - 1 Years",
        "Key Skills": "Business process|Manager Technology|Outsourcing|Management|Business applications|Operations|Salesforce",
        "Location": "Bengaluru",
        "Responsibilities": "Address all areas of global sourcing and supply chain management including commodity business plans, supplier performance management and global market analysis."
    },
    {
        "Job ID": 100,
        "Crawl Timestamp": "2020-11-05 21:40:51 +0000",
        "JobTitle": "Technician Require",
        "Company": "Anheuser-Busch InBev",
        "Job Salary": "1,50,000 - 2,50,000 PA.",
        "Job Experience Required": "0 - 1 Years",
        "Key Skills": "fresher| foreman| electrical| Instrumentation| mechnical| carpenter| iti",
        "Location": "Mumbai",
        "Responsibilities": "Develop deep understanding of cost competing technologies, process and products to guide and influence product development and decisions; create and/or optimize models for evaluating modules, components and new processes."
    }
]